app/controllers/articles_controller.rb

    def create
        @article = Article.new(article_params)
        @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Tag Sample Article"], ["body", "Yipeeeee"], ["created_at", "2020-02-04 00:17:58.597485"], ["updated_at", "2020-02-04 00:17:58.597485"]]

    def destroy
        @article = Article.find(params[:id])
        @article.destroy
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 6]]

    def update
        @article = Article.find(params[:id])
        @article.update(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "articles" SET "image_file_name" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["image_file_name", "cat-4348355_960_720.jpg"], ["image_updated_at", "2020-02-06 21:46:32.163086"], ["updated_at", "2020-02-06 21:46:32.294578"], ["id", 1]]